# Brewfile - Declarative package management for macOS
# Run: brew bundle [--file=path/to/Brewfile]

# Essential CLI Tools
brew "git"
brew "curl"
brew "wget"

# Shell & Terminal
brew "zsh"
brew "tmux"
brew "fzf"

# Modern CLI Replacements
brew "ripgrep"       # Better grep
brew "fd"            # Better find
brew "bat"           # Better cat
brew "eza"           # Better ls
brew "zoxide"        # Better cd

# Development Tools
brew "neovim"
brew "lazygit"
brew "chafa"         # Image viewer in terminal
brew "jq"            # JSON processor
brew "yq"            # YAML processor
brew "tree"          # Directory tree viewer

# System Utilities
brew "htop"
brew "btop"          # Better htop
brew "tldr"          # Simplified man pages

# Terminal Emulator
cask "alacritty"

# Fonts (required for Alacritty config)
cask "font-fira-code-nerd-font"

# Additional fonts (optional - uncomment if needed)
# cask "font-jetbrains-mono-nerd-font"
# cask "font-hack-nerd-font"

# Additional GUI Apps (optional - uncomment if needed)
# cask "visual-studio-code"
# cask "docker"
# cask "iterm2"
# cask "rectangle"     # Window manager
